001_snappyMultiRegionHeater/constant/rightSolid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/rightSolid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
    maxX
    {
        type            patch;
        nFaces          40;
        startFace       2508;
    }

    minZ
    {
        type            patch;
        inGroups        1 ( wall );
        nFaces          52;
        startFace       2548;
    }

    maxZ
    {
        type            patch;
        inGroups        1 ( wall );
        nFaces          52;
        startFace       2600;
    }

    rightSolid_to_bottomAir
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          520;
        startFace       2652;
        sampleMode      nearestPatchFace;
        sampleRegion    bottomAir;
        samplePatch     bottomAir_to_rightSolid;
    }

    rightSolid_to_topAir
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          520;
        startFace       3172;
        sampleMode      nearestPatchFace;
        sampleRegion    topAir;
        samplePatch     topAir_to_rightSolid;
    }

    rightSolid_to_heater
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          40;
        startFace       3692;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_rightSolid;
    }

)


// ************************************************************************* //
